#+TITLE: Rust

**** Returning Values from Loops
you can add the value you want returned after the break expression you use to stop the loop; that value will be returned out of the loop so you can use it, as shown here:
#+begin_src rust
fn main() {
    let mut counter = 0;

    let result = loop {
        counter += 1;

        if counter == 10 {
            break counter * 2;
        }
    };

    println!("The result is {}", result);
}
#+end_src

#+RESULTS:
: The result is 20
**** Conditional Loops with while
#+begin_src rust
fn main() {
    let mut number = 3;

    while number != 0 {
        println!("{}!", number);

        number -= 1;
    }

    println!("LIFTOFF!!!");
}
#+end_src

#+RESULTS:
: 3!
: 2!
: 1!
: LIFTOFF!!!
**** Looping Through a Collection with for
You could use the while construct to loop over the elements of a collection, such as an array
#+begin_src rust
fn main() {
    let a = [10, 20, 30, 40, 50];
    let mut index = 0;

    while index < 5 {
        println!("the value is: {}", a[index]);

        index += 1;
    }
}
#+end_src
All five array values appear in the terminal, as expected. Even though index will reach a value of 5 at some point, the loop stops executing before trying to fetch a sixth value from the array.

But this approach is error prone; we could cause the program to panic if the index length is incorrect. It’s also slow, because the compiler adds runtime code to perform the conditional check on every element on every iteration through the loop.
As a more concise alternative, you can use a for loop and execute some code for each item in a collection. A for loop looks like the code in Listing 3-5.
#+begin_src rust
fn main() {
    let a = [10, 20, 30, 40, 50];

    for element in a.iter() {
        println!("the value is: {}", element);
    }
}
#+end_src

Here’s what the countdown would look like using a for loop and another method we’ve not yet talked about, rev, to reverse the range:
#+begin_src rust
fn main(){
    for number in (1..5).rev(){
        println!("{}",number);
    }
}
#+end_src

#+RESULTS:
: 4
: 3
: 2
: 1

** What is ownership

#+begin_src rust
fn main() {
    {                      // s is not valid here, it’s not yet declared
        let s = "hello";   // s is valid from this point forward

        // do stuff with s
    }                      // this scope is now over, and s is no longer valid
}
#+end_src
There is a natural point at which we can return the memory our String needs to the allocator: when s goes out of scope. When a variable goes out of scope, Rust calls a special function for us. This function is called drop, and it’s where the author of String can put the code to return the memory. Rust calls drop automatically at the closing curly bracket.

This kind of string can be mutated:
#+begin_src rust
fn main() {
    let mut s = String::from("hello");

    s.push_str(", world!"); // push_str() appends a literal to a String

    println!("{}", s); // This will print `hello, world!`
}
#+end_src

#+RESULTS:
: hello, world!
*** Ways Variables and Data Interact: Clone
If we do want to deeply copy the heap data of the String, not just the stack data, we can use a common method called clone. We’ll discuss method syntax in Chapter 5, but because methods are a common feature in many programming languages, you’ve probably seen them before.

#+begin_src rust
fn main() {
    let s1 = String::from("hello");
    let s2 = s1.clone();

    println!("s1 = {}, s2 = {}", s1, s2);
}
#+end_src

#+RESULTS:
: s1 = hello, s2 = hello
So what types implement the Copy trait? You can check the documentation for the given type to be sure, but as a general rule, any group of simple scalar values can implement Copy, and nothing that requires allocation or is some form of resource can implement Copy. Here are some of the types that implement Copy:

   - All the integer types, such as u32.
   - The Boolean type, bool, with values true and false.
   - All the floating point types, such as f64.
   - The character type, char.
   - Tuples, if they only contain types that also implement Copy. For example, (i32, i32) implements Copy, but (i32, String) does not.
** Example
#+begin_src rust
#[derive(Debug)]
struct Rectangle {
    width: u32,
    height: u32,
}

fn main() {
    let rect1 = Rectangle {
        width: 30,
        height: 50,
    };

    println!("rect1 is {:?}\n", rect1);
    println!("rect1 is {:#?}", rect1);
}
#+end_src

#+RESULTS:
: rect1 is Rectangle { width: 30, height: 50 }
:
: rect1 is Rectangle {
:     width: 30,
:     height: 50,
: }

** Method Syntax
#+begin_src rust
#[derive(Debug)]
struct Rectangle {
    width: u32,
    height: u32,
}

impl Rectangle {
    fn area(&self) -> u32 {
        self.width * self.height
    }
}

fn main() {
    let rect1 = Rectangle {
        width: 30,
        height: 50,
    };

    println!(
        "The area of the rectangle is {} square pixels.",
        rect1.area()
    );
}
#+end_src

#+RESULTS:
: The area of the rectangle is 1500 square pixels.

*** Methods with More Parameters

#+begin_src rust
#[derive(Debug)]
struct Rectangle {
    width: u32,
    height: u32,
}

impl Rectangle {
    fn can_hold(&self, other: &Rectangle) -> bool {
        self.width > other.width && self.height > other.height
    }
}

fn main() {
    let rect1 = Rectangle {
        width: 30,
        height: 50,
    };
    let rect2 = Rectangle {
        width: 10,
        height: 40,
    };
    let rect3 = Rectangle {
        width: 60,
        height: 45,
    };

    println!("Can rect1 hold rect2? {}", rect1.can_hold(&rect2));
    println!("Can rect1 hold rect3? {}", rect1.can_hold(&rect3));
}
#+end_src

#+RESULTS:
: Can rect1 hold rect2? true
: Can rect1 hold rect3? false
*** Patterns that Bind to Values
#+begin_src rust
#[derive(Debug)]
enum UsState {
    Alabama,
    Alaska,
    // --snip--
}

enum Coin {
    Penny,
    Nickel,
    Dime,
    Quarter(UsState),
}

fn value_in_cents(coin: Coin) -> u8 {
    match coin {
        Coin::Penny => 1,
        Coin::Nickel => 5,
        Coin::Dime => 10,
        Coin::Quarter(state) => {
            println!("State quarter from {:?}!", state);
            25
        }
    }
}

fn main() {
    value_in_cents(Coin::Quarter(UsState::Alaska));
}
#+end_src

#+RESULTS:
#+begin_example
State quarter from Alaska!
#+end_example
*** Reading Elements of Vectors
#+begin_src rust
fn main() {
    let v = vec![1, 2, 3, 4, 5];

    let second: &i32 = &v[1];
    let third: &i32 = &v[2];
    println!("The second element is {}", second);
    println!("The third element is {}", third);

    match v.get(2) {
        Some(third) => println!("The third element is {}", third),
        None => println!("There is no third element."),
    }
}
#+end_src

#+RESULTS:
: The second element is 2
: The third element is 3
: The third element is 3
When the get method is passed an index that is outside the vector, it returns None without panicking. You would use this method if accessing an element beyond the range of the vector happens occasionally under normal circumstances. Your code will then have logic to handle having either Some(&element) or None.
*** Appending to a String with push_str and push
#+begin_src rust
fn main() {
    let mut s1 = String::from("foo");
    let s2 = "bar";
    s1.push_str(s2);
    println!("s2 is {}", s2);
    println!("s1 is {}", s1);

    let mut s = String::from("foo");
    s.push_str("bar");
    println!("s is {}", s);


    let mut s = String::from("lo");
    s.push('l');
    println!("s is {}", s);

}
#+end_src

#+RESULTS:
: s2 is bar
: s1 is foobar
: s is foobar
: s is lol
*** Concatenation with + Operator or the format! Macro
#+begin_src rust
fn main() {
    let s1 = String::from("Hello, ");
    let s2 = String::from("world!");
    let s3 = s1 + &s2; // note s1 has been moved here and can no longer be used
    println!("s is {}", s3);
}
#+end_src

#+RESULTS:
: s is Hello, world!

#+begin_src rust
fn main() {
    let s1 = String::from("tic");
    let s2 = String::from("tac");
    let s3 = String::from("toe");

    let s = s1 + "-" + &s2 + "-" + &s3;
    println!("s is {}", s);
}
#+end_src

#+RESULTS:
: s is tic-tac-toe
: s is toe
: s is tac

or:
#+begin_src rust
fn main() {
    let s1 = String::from("tic");
    let s2 = String::from("tac");
    let s3 = String::from("toe");

    let s = format!("{}-{}-{}", s1, s2, s3);
    println!("s is {}", s);
}
#+end_src

#+RESULTS:
: s is tic-tac-toe
: s is toe
: s is tac

This code also sets s to tic-tac-toe. The format! macro works in the same way as println!, but instead of printing the output to the screen, it returns a String with the contents. The version of the code using format! is much easier to read and doesn’t take ownership of any of its parameters.

*** Methods for Iterating Over Strings
#+begin_src rust
#![allow(unused)]
fn main() {
for c in "नमस्ते".chars() {
    println!("{}", c);
}
}
#+end_src

#+RESULTS:
: न
: म
: स
: ्
: त
: े

#+begin_src rust
#![allow(unused)]
fn main() {
for b in "नमस्ते".bytes() {
    println!("{}", b);
}
}
#+end_src

#+RESULTS:
#+begin_example
224
164
# -- snip --
165
135
#+end_example

